@echo off
title 東方旧作図鑑

:MENU
cls
echo============================
echo       東方旧作図鑑
echo============================
echo.
echo [1] 東方靈異伝
echo [2] 東方封魔録
echo [3] 東方夢時空
echo [4] 東方幻想郷
echo [5] 東方怪綺談
echo [6] 年表
echo [k] クレジット
echo [0] end
set /px=番号を入力してください:
if "%x%"=="1" goto rei
if "%x%"=="2" goto huuma
if "%x%"=="3" goto yume
if "%x%"=="4" goto genn
if "%x%"=="5" goto kaiki
if "%x%"=="6" goto nennpyou
if "%x%"=="k" goto kure
if "%x%"=="0" goto end
:end
echo see you next time！
timeout /t 5 >nul
exit

:rei
cls
echo =========================
echo        東方靈異伝
echo =========================
echo 東方靈異伝について
echo 平成8年1996年に出ました。東方project記念すべき第一作！
echo ルールは靈夢を操作して陰陽玉を使ってパネルをすべてめくると1面クリア
echo　全20面あり、5面ボスを倒すと魔界ルートか地獄ルートを選択できる。
echo.
echo ストーリー

echo 何者かに神社破壊された
echo ==========================
echo       キャラクター
echo ==========================
echo.
echo.
echo 博麗靈夢　靈の部分が旧字体で髪色は紫、
echo SinGyoku　五面ボスで倒すと、魔界ルートか地獄ルートを選択できる
echo YuugenMagan　魔界ルート10面ボス　黄色い人型の周りに、五つのでかい目玉がある
echo Elis 魔界ルート15面ボス　金髪で星のステッキを持ち大きな羽がついていて悪魔のような見た目です。
echo Sariel 魔界ルート20面ボス 見た目は天使のようで、一度倒すと第二形態に突入する
echo Mima 地獄ルート10面ボス　白い三角頭巾をかぶり、足がなく髪色は緑。青いマントをつけています。
echo Kikuri 地獄ルート15面ボス　外見は女の人の上半身を浮かび上がったレリーフで周りにはピンク色の炎が浮かんでいる。
echo Konngara 地獄ルート20面ボス　右手には盃のようなものをもち左手に剣を持っている。足はない。
echo 陰陽玉妖精 魔界ルートのグッドエンディングに登場する。陰陽玉が強く光った後この妖精に変身する。
echo サイズは靈夢の手のひらに収まるほど小さい。
echo 山歩き　地獄ルートグッドエンディングで陰陽玉が変身した姿赤い帽子をかぶっている。
pause
goto MENU
:huuma
cls
echo ================================
echo          東方封魔録
echo ================================
echo 東方封魔録について
echo 東方project第二弾となる作品でSTGとしては初！
echo そして魔理沙が初登場！
echo 平成9年1997年に出ました。
echo.
echo ストーリー
echo 神社にたくさんの妖怪などが住み着いた
echo ======================
echo     キャラクター
echo ======================
echo 博麗靈夢　皆さんおなじみ
echo 玄爺　空を飛べる亀。靈夢を乗せてサポートをする
echo 化け化け　雑魚敵
echo 一面中ボス　神社戦車（仮称）　道中の橋の上で登場
echo 一面ボス　里香（のりか）　人間の戦車技師。一面中ボスの戦車と化け化けは里香が作ったと思われます。一面とEXボス
echo 二面中ボス　呪い子（仮称）自機を追いかける呪の文字を飛ばす。文字の色は白色
echo 二面ボス　明羅　（めいら）イケメン過ぎて靈夢に男だと勘違いされる。あと靈夢にやられたとき埋められてそうになる。
echo 三面中ボス　幻夢盤(げんむばん）（仮称）二体で襲ってくる
echo 三面ボス　幻夢石　（仮称）（げんむせき）要塞・兵器型のボスでセルフはない
echo 四面中ボス　魔天使（仮称）
echo 四面ボス　魔理沙　ゲーム中の名前は誤字のため魔梨沙になっている。魅魔を魅魔様と呼ぶ。
echo ちなみにテーマ曲の恋色マジックは後に永夜抄で恋色マスタースパークとしてアレンジなどされている。
echo Win版魔理沙と同一人物。
echo 五面ボス　魅魔　（みま）三日月ステッキを持ってる。他のは靈異伝参照
echo EXボス　里香（イビルアイΣ）　飛行戦車のイビルアイΣ（イビルアイシグマ）に乗っていて
echo その外見は巨大な黒い一つ目でコウモリの羽を模したものがついており、とても戦車に見えない。
echo あと、1面の時の里香の服装とEXの時とは服装が違う。
pause
goto MENU
:yume
cls
echo ==================================
echo           東方夢時空
echo ==================================
echo 東方夢時空について
echo 東方project第三弾です。
echo 平成9年1997年
echo 後の東方花映塚や東方獣王園につながる対戦型シューティングゲームです。
echo ストーリー
echo.
echo 遺跡に訪れたものを幸せにするものをプレゼントしてくれるらしい
echo ====================================
echo            キャラクター
echo ====================================
echo 
echo 
echo 
pause
goto MENU
:genn
cls
echo ==================================
echo           東方幻想郷
echo ==================================
echo 東方幻想郷について
echo 東方project第四弾です！
echo 平成10年1998年に出ました。
echo 幽香初登場！
echo ストーリー
echo.
echo 大量の悪霊が神社にあふれてきた
echo ===================================
echo           キャラクター
echo ===================================
echo 自機　博麗靈夢
echo 自機　霧雨魔理沙
echo 一面中ボス　妖蓮花（仮称）（ようれんげ）巨大な花の姿をしている。
echo 画面したからモグラのように土の中を移動して主人公の前までくる。
echo 一面ボス　オレンジ　バトンを持っていて、戦闘時はわっか？オーラ？見たいのが出る
echo 二面ボス　くるみ　金髪で頭にリボンを付けて、コウモリの羽がついている。
echo 三面中ボス　闇鏡（あんきよう）（仮称）　常闇を映す鏡で悪魔の羽があり、骨のような柄で四本の糸のようなものがある
echo 三面ボス　エリー　めっちゃ曲がってる鎌を持っており、それを投げたり、床のタイルをめくって投げて攻撃してくる。
echo 四面中ボス　光り子（仮称）　幻想郷四面中ボスと怪綺談三面中ボスに付けられた仮称で同一人物の可能性が。
echo　四面ボス　靈夢or魔理沙
echo 五、六面ボス　幽香　現実世界と夢幻世界の境界にある館の夢幻館（むげんかん）の主です。
echo 花映塚の風見幽香とはおそらく同一人物。
echo 初登場時はパジャマ姿
echo EXボス(1) 夢月　幻月の双子の妹
echo EXボス(2) 幻月　夢月の双子の姉
pause
goto MENU
:kaiki
cls
echo ===================================
echo           東方怪綺談
echo ===================================
echo 東方怪綺談について
echo 東方project第五弾です!
echo 平成10年1998年に出ました。
echo そしてアリス初登場！
echo ストーリー
echo.
echo 魔界の扉があるといわれる洞窟が現れた
echo ===================================
echo            キャラクター
echo ===================================
echo 自機　博麗靈夢
echo 自機　霧雨魔理沙
echo 自機　魅魔
echo 自機　幽香
echo 一面中ボス　輪妖精（りんようせい）（仮称）周囲に青い輪っかがある
echo 一面ボス　サラ　魔界に通じる扉の門番をしている。
echo 二面中ボス　神鏡（しんきょう）（仮称）　ふわふわ動きながら弾幕をばらまくように撃ってくる。
echo 二面ボス　ルイズ　人間界に旅行しに来た人。
echo 三面中ボス　光り子　（仮称）東方幻想郷のと同一人物らしい。
echo 三面ボス＆EXボス　アリス　妖々夢とかのアリスと同一人物らしい。
echo 四面中ボス　青ルイズ　ルイズの色違いのような見た目などからこの名前になったらしい。
echo 四面ボス　ユキ　マイが先にやられると怒って本気に。
echo 四面ボス　マイ　最初は無口だったのがユキを先に倒すと普通にしゃべりだし本気に。
echo 五面中ボス　妖奈（あやな）（仮称）　弾幕のスピードが全体的に早い気がする。
echo 五面ボス　夢子　メイドさんで剣を使う。
echo 六面ボス　神綺　（しんき）　魔界を作った創造主
echo EX中ボス　トランプキング　王冠かぶってる
echo 靈夢のエンディングに出てくる魔界人
echo エンディングに出てくる妖精
pause
goto MENU
:nennpyou
cls
echo ====================
echo 　　　年表
echo ====================
echo 平成8年 1996年 東方靈異伝
echo 平成9年 1997年 東方封魔録
echo 平成9年 1997年 東方夢時空
echo 平成10年 1998年 東方幻想郷
echo 平成10年 1998年 東方怪綺談
pause
goto MENU
:kure
cls
echo 幻想郷資料館
echo 製作者 きくっち
echo 製作日 2026年令和8年 5月10日
echo この図鑑はアップデートする場合があります。新しいのが欲しい場合は、幻想郷資料館へ
echo バージョン　1.1
pause
goto MENU